Repository: PrettyPet-Organization/microservice-python-pp
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Authorization/authentication
ru: Авторизация/аутентификация

source: The Email must be set
ru: Необходимо указать адрес электронной почты

source: Superuser must have is_staff=True.
ru: У суперпользователя должно быть значение is_staff=True.

source: Superuser must have is_superuser=True.
ru: У суперпользователя должно быть значение is_superuser=True.

source: Email
ru: Электронная почта

source: Phone number
ru: Телефонный номер

source: User password
ru: Пароль пользователя

source: Code word for entry
ru: Кодовое слово для входа

source: Почта
ru: Mail

source: Пароль
ru: Password

source: Подтверждение пароля
ru: Password confirmation

source: Кодовое слово (необязательно)
ru: Code word (optional)

source: Имя пользователя
ru: User name

source: The password must be at least 8 characters.
ru: Пароль должен содержать не менее 8 символов

source: The password can only contain letters and numbers.
ru: Пароль может содержать только буквы и цифры.

source: The password must contain at least one capital letter.
ru: Пароль должен содержать как минимум одну заглавную букву.

source: Invalid substring found.
ru: Найдена недопустимая подстрока.

source: Age cannot be negative.
ru: Возраст не может быть отрицательным.

source: The first letter must be capitalized.
ru: Первая буква должна быть заглавной.

source: Invalid number format for prefix {prefix}.
ru: Недопустимый числовой формат для префикса {prefix}.

source: Incorrect number prefix.
ru: Неверный префикс номера.

source: The file size must not exceed 4MB.
ru: Размер файла не должен превышать 4 МБ.

source: Image resolution should not exceed 200x200 pixels.
ru: Разрешение изображения не должно превышать 200х200 пикселей.

source: Common functionality for applications
ru: Общие функциональные возможности для приложений

source: Author
ru: Автор

source: Title
ru: Заголовок

source: Description
ru: Описание

source: Image
ru: Изображение

source: Likes counter
ru: Счетчик лайков

source: Is open new
ru: Открыт новый

source: Topics
ru: Темы

source: Tags
ru: Теги

source: Role name
ru: Название роли

source: Tag name
ru: Название тега

source: Tool name
ru: Название инструмента

source: Topic name
ru: Название темы

source: Link name
ru: Название ссылки

source: General project utilities
ru: Главные утилиты проекта

source: Check {item} failed.
ru: Не удалось проверить {элемент}.

source: Successfully configured!
ru: Успешно настроен!

source: Logging is not configured in the project.
ru: Ведение журнала в проекте не настроено.

source: Logging is working!
ru: Ведение журнала работает!

source: Module import exception: {e}
ru: Исключение при импорте модуля: {e}

source: Logging configuration error: missing key {e}
ru: Ошибка конфигурации ведения журнала: отсутствует ключ {e}

source: An error occurred while setting up logging: {e}
ru: При настройке ведения журнала произошла ошибка: {e}

source: Everything related to hackathons
ru: Все, что связано с хакатонами

source: Everything related to profiles
ru: Все, что связано с профилями

source: Cities
ru: Города

source: Name
ru: Имя

source: Age
ru: Возраст

source: Photo url
ru: URL-адрес фотографии

source: Hobbies
ru: Хобби

source: Everything related to projects
ru: Все, что связано с проектами

source: Group name
ru: Название группы

source: Actual project
ru: Актуальный проект

source: Participant profile
ru: Профиль участника

source: Participant roles
ru: Роли участников

source: Participant tools
ru: Инструменты для участников

source: Participant groups
ru: Группы участников

source: Requested project
ru: Запрошенный проект

source: Cover letter
ru: Сопроводительное письмо

source: Resume url
ru: URL-адрес резюме

source: Status the request
ru: Статус запроса

source: Type name
ru: Имя типа

source: Not Started
ru: Не начато

source: In Process
ru: В процессе

source: Not Finished
ru: Не завершенный

source: Finished
ru: Завершенный

source: Type for project
ru: Тип в проекте

source: Project name
ru: Имя проекта

source: Core idea
ru: Основная идея

source: End time for project
ru: Время окончания проекта

source: Actual status
ru: Актуальный статус

source: Tools for project
ru: Инструменты для проекта

source: Role for project
ru: Роль в проекте

source: Tags for project
ru: Теги в проекте

source: Groups for project
ru: Группы в проекте

source: Role
ru: Роль

source: Project
ru: Проект

source: Participants needed
ru: Необходимо участников

source: Tool
ru: Инструмент
